app/Modules/Pedidos/Entities/Pedidos.php

select count(*) as aggregate from `pedidos` inner join `detalle_pedidos_platos` as `det` on `det`.`pedido_id` = `pedidos`.`id` inner join `platos` as `pl` on `det`.`plato_id` = `pl`.`id` where `det`.`deleted_at` is null and `pedidos`.`deleted_at` is null and `pedidos`.`deleted_at` is null group by `pedidos`.`mesa`, `pedidos`.`client`, `pedidos`.`date` order by `pedidos`.`id` desc
select `pedidos`.`id` as `id`, `pedidos`.`mesa` as `mesa`, `pedidos`.`client` as `client`, SUM(pl.price*det.cantidad) AS monto, `pedidos`.`date` as `date`, `pedidos`.`updated_at` as `updated_at` from `pedidos` inner join `detalle_pedidos_platos` as `det` on `det`.`pedido_id` = `pedidos`.`id` inner join `platos` as `pl` on `det`.`plato_id` = `pl`.`id` where `det`.`deleted_at` is null and `pedidos`.`deleted_at` is null and `pedidos`.`deleted_at` is null group by `pedidos`.`mesa`, `pedidos`.`client`, `pedidos`.`date` order by `pedidos`.`id` desc
---
    public static function getAll($filters, $skip, $pageSize, $sort) {
        $query = static::select('pedidos.id as id',
            'pedidos.mesa as mesa',
        'pedidos.client as client',
        DB::raw("SUM(pl.price*det.cantidad) AS monto"),
        'pedidos.date as date',
        'pedidos.updated_at as updated_at')
        ->Join('detalle_pedidos_platos as det','det.pedido_id','=','pedidos.id')
        ->Join('platos as pl','det.plato_id','=','pl.id')
        ->groupBy('pedidos.mesa')
        ->groupBy('pedidos.client')
        ->groupBy('pedidos.date')->orderBy('pedidos.id', 'desc')
        ->wherenull('det.deleted_at')
        ->wherenull('pedidos.deleted_at');

        if (empty($filters)) {
          $filters = [];
        }
        $kQuery = new Kendo2QueryBuilder($query);
        $query = $kQuery->buildQueryFromKendoFilter($filters);
        $count = $query->count();
        if ($sort) {
          $query = $query->orderBy($sort['field'], $sort['dir']);
        }
        $query = $query->get()->toArray();