app/Http/Controllers/HomeController.php

update `pedidos` set `updated_at` = '2022-01-30 02:00:38' where `id` = 59
---
    public function update(Request $request)
    {
        $pedido = Pedidos::find($request->id);
        $pedido->date = strtoupper($request->date);
        $pedido->mesa = strtoupper($request->mesa);
        $pedido->client = strtoupper($request->client);
        $pedido->updated_at = Carbon::now()->toDateTimeString();

update `pedidos` set `deleted_at` = '2022-01-30 01:03:53', `updated_at` = '2022-01-30 01:03:53' where `id` = 63
---
    public function destroy(Pedidos $pedidos)
    {
        $pedido = Pedidos::find($pedidos->id);
        $pedido->delete();

select `d`.`id`, `d`.`pedido_id`, `d`.`plato_id`, `d`.`cantidad` from `detalle_pedidos_platos` as `d` where `d`.`pedido_id` = '59' and `d`.`deleted_at` is null
---
    public function getplatos($id_pedido) {
		$query = DB::table('detalle_pedidos_platos as d')
				->select('d.id','d.pedido_id','d.plato_id','d.cantidad')
                ->where('d.pedido_id','=',$id_pedido)
                ->wherenull('d.deleted_at')
				->get()->toArray();