app/Repositories/MenuDAO.php

    public static function getByType($type, $roles, $superuser)
    {
        $query = Permission::select( DB::raw('DISTINCT(permissions.id)'),
                                    'permissions.description',
                                    'permissions.type',
                                    'permissions.name',
                                    'permissions.display_name',
                                    'permissions.parent_id',
                                    'permissions.url',
                                    'permissions.icon',
                                    'permissions.sub_parent',
                                    'permissions.tree_role' )

                            ->where('type', $type)
          ->whereNull('deleted_at')
                            ->when( ! $superuser , function ($query) use ($roles){

                                return $query->join('permission_role as PR', 'id', '=', 'PR.permission_id')
                                             ->whereIn('PR.role_id', $roles);
                            })
                            ->orderBy('permissions.description')
                            ->get();
---
select DISTINCT(permissions.id), `permissions`.`description`, `permissions`.`type`, `permissions`.`name`, `permissions`.`display_name`, `permissions`.`parent_id`, `permissions`.`url`, `permissions`.`icon`, `permissions`.`sub_parent`, `permissions`.`tree_role` from `permissions` inner join `permission_role` as `PR` on `id` = `PR`.`permission_id` where `type` = 'M' and `deleted_at` is null and `PR`.`role_id` in (2) order by `permissions`.`description` asc

     public static function getByIdCpe($parent_id)
    {
        $query = Permission::select('permissions.id',
                                    'permissions.description',
                                    'permissions.type',
                                    'permissions.name',
                                    'permissions.display_name',
                                    'permissions.parent_id',
                                    'permissions.url',
                                    'permissions.icon',
                                    'permissions.sub_parent',
                                    'permissions.tree_role' )
                            ->where('type', 'M')
                            ->where('parent_id', $parent_id)
                            ->where('tree_role', 0)
                            ->whereNull('deleted_at')
                            ->orderBy('permissions.display_name')
                            ->get();
---
select `permissions`.`id`, `permissions`.`description`, `permissions`.`type`, `permissions`.`name`, `permissions`.`display_name`, `permissions`.`parent_id`, `permissions`.`url`, `permissions`.`icon`, `permissions`.`sub_parent`, `permissions`.`tree_role` from `permissions` where `type` = 'M' and `parent_id` = 22 and `tree_role` = 0 and `deleted_at` is null order by `permissions`.`display_name` asc