app/Repositories/ParamsDAO.php

  public static function getParams($name)
  {
    $params = DB::table('params')
      ->select('params.name', 'params.value')
      ->join('param_master as master', 'params.master', '=', 'master.id')
      ->whereNull('params.deleted_at')
      ->where('master.name', '=', $name)
      ->pluck('params.value', 'params.name')->toArray();
---
select `params`.`name`, `params`.`value` from `params` inner join `param_master` as `master` on `params`.`master` = `master`.`id` where `params`.`deleted_at` is null and `master`.`name` = 'users_area'