app/Repositories/RoleDAO.php

    public static function selectRoles($filters, $skip, $pageSize, $sort)
    {
      //dd($filters);

      $query = Role::select(['id', 'display_name', 'description','created_at']);
//      $query->addSelect(DB::raw('TO_CHAR(created_at,\'DD/MM/YYYY HH24:mm:SS\') created_at'));
     // $query = $query = DB::table('roles')->select(['id', 'display_name', 'description','created_at','deleted_at']);
      if(empty($filters)){

        $filters = [];
      }
        $kQuery = new Kendo2QueryBuilder($query);
        $query = $kQuery->buildQueryFromKendoFilter($filters);

        $count = $query->count();

        if($sort)
        {
            $query = $query->orderBy($sort['field'],$sort['dir']);
        }

         if($pageSize)
        {
            $query = $query->skip($skip)->take($pageSize)->get();
---
select count(*) as aggregate from `roles` where `roles`.`deleted_at` is null
select `id`, `display_name`, `description`, `created_at` from `roles` where `roles`.`deleted_at` is null order by `id` desc limit 10 offset 0

    public static function getAll()
    {
        return Role::select('id', 'display_name')
                    ->where('name', '<>', 'superuser')
                    ->orderBy('id', 'asc')->get();
---
select `id`, `display_name` from `roles` where `name` <> 'superuser' and `roles`.`deleted_at` is null order by `id` asc