app/Repositories/UserDAO.php

select count(*) as aggregate from `users` where `users`.`deleted_at` is null
---
    public static function getUsersForGrid($filters, $skip, $pageSize, $sort)
    {

        $query = User::select(['users.id',
          'email', 'username',
          'fullname',
          'cellphone', 'status','users.created_at']
            //DB::raw("CASE WHEN deleted_at IS NULL then 'Activo' ELSE 'Inactivo' END AS status")]
        );
//        $query->addSelect(DB::raw('TO_CHAR(users.created_at,"DD/MM/YYYY HH24:mm:SS") created_at'));
//        $query->addSelect(DB::raw('DATE_FORMAT(users.created_at,"%d/%m/%Y") AS created_at'));
        if(empty($filters)){

          $filters = [];
        }
        $kQuery = new Kendo2QueryBuilder($query);
        $kQuery->setNamespace('users', ['created_at']);
        $kQuery->enum('status', ['Inactivo' => 0, 'Activo' => 1]);
        //$kQuery->setAliases(['p.valor' => 'area']);
        $query = $kQuery->buildQueryFromKendoFilter($filters);

        $count = $query->count();